src/main/resources/soapfiles/soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ex="http://example.com/">
    <soapenv:Body>
        <ex:Request>
            <ex:Message>Hello, SOAP Server!</ex:Message>
        </ex:Request>
    </soapenv:Body>
</soapenv:Envelope>
